// ==================================== Task 1 ====================================
// var array = ['First', 'Second', 'Third']
// for (let i = 0; i < array.length; i++) {
//     console.log(array[i])
// }
// ==================================== Task 1 ====================================
// ==================================== Task 2 ====================================
// function func1(function_parameter) { 
//     function_parameter();
//     var y = x
//     if (y > 50)
//     console.log('ძვირი');
//     else if (y >= 20 && y <= 50)
//     console.log('საშუალო');
//     else 
//     console.log('იაფი');
//   }
//   function func2(){ 
//     console.log(x);
//   }
//   var x = Math.floor(Math.random()*100);
//   func1(func2);
// ==================================== Task 2 ====================================
// ==================================== Task 3 ====================================
var arr =  [15,53,22,198,10,28,16,70,33,951]
console.log(arr)
// ==================================== Task 3 ====================================